src/Catalogs/ШаблоныДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныДиалогов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАктивности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеАктивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияАктивации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПовторнойАктивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыПовторнойАктивации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭлементыДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЭлементыДиалогов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблоныДиалогов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЭлементаДиалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЭлементовДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующийЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДиалогов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияЭлементовДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрДействия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаГостя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФормы</Name>
					<Comment>Для подстановки в отображаемую форму</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыДиалогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстКнопки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФормыГостя</Name>
					<Comment>Для подстановки в отображаемую форму</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныДиалогов/Ext/ObjectModule.bsl
Функция ТекстGv() Экспорт
	
	Шаблон=ссылка;
	
	Выб = Справочники.ЭлементыДиалогов.ВыбратьИерархически(,Шаблон,,"");
	Стр="";ОписанияВершин = "";
	ПОка Выб.Следующий() Цикл
		Style_="";
		ЕСли Выб.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Вопрос Тогда
			Фигура = "record";
			Style_="style=rounded,";
		ИначеЕСли Выб.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Выход ИЛИ Выб.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Старт Тогда
			Фигура = "box3d";
			
		ИначеЕСли Выб.Родитель.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Вопрос Тогда
			Фигура = "circle";
		ИначеЕСли Выб.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Сообщение Тогда
			Фигура = "egg";

			
		Иначе
			Фигура = "box";
			Style_="style=rounded,";

		КонецЕсли;
		
		
		УИД="N"+Выб.Ссылка.УникальныйИдентификатор();
		УИДРодителя="N"+Выб.Родитель.УникальныйИдентификатор();
		УИДРодителяРодителя="N"+Выб.Родитель.Родитель.УникальныйИдентификатор();
		Если Выб.СледующийЭлемент = Неопределено  Тогда
		
			УИДСлед = "Неопределено";
		Иначе 
			
			УИДСлед="N"+Выб.СледующийЭлемент.УникальныйИдентификатор();
		
		КонецЕсли; 
		
		
		УИД = СтрЗаменить(УИД,"-","");
		УИДРодителя = СтрЗаменить(УИДРодителя,"-","");
		УИДРодителяРодителя = СтрЗаменить(УИДРодителяРодителя,"-","");
		УИДСлед = СтрЗаменить(УИДСлед,"-","")         ;
		
		Если Выб.Родитель.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Вопрос Тогда
			УИД = УИДРодителя;
		КонецЕсли;
		
		Label = Выб.Наименование;
		Если Фигура = "record" Тогда
			Label = СтрЗаменить(Label," ",Символы.НПП);
			Label = СтрЗаменить(Label,":"," | ");
			
			
			Label ="{ "+Label+"|{<1> Да |<2> Нет } }";
		Иначе
			
			Label = СтрЗаменить(Label,"Сообщение:","Сообщение"+Символы.ПС);
			Label = СтрЗаменить(Label,":",Символы.ПС);
			
		КонецЕсли;
		
		Если Не УИД = УИДРодителя Тогда
		
			ОписанияВершин = ОписанияВершин + " "+УИД+"["+Style_+"shape="+Фигура+",label="""+Label+""",rank="""+лев(Выб.НомерПП,1)+Выб.УровеньВВыборке()+"""]";	
		Иначе
			
		КонецЕсли; 
		
		
		Стр = Стр+" ";
			
		Если НЕ Выб.Родитель.Пустая() Тогда
			Если Не УИД = УИДРодителя Тогда
 				Если Выб.Родитель.Родитель.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Вопрос Тогда
				
					стр = Стр+УИДРодителяРодителя +":"+ ?(Выб.Родитель.Наименование="Да",1,2)+"->"+ УИД;	
				ИНаче
					стр = Стр+УИДРодителя +"->"+ УИД;	
				
				КонецЕсли; 
				
			Иначе
				стр = Стр+УИД;	
			КонецЕсли;
		Иначе
			//стр = Стр+УИД;
		КОнецЕсли;
		
		Если ЗначениеЗаполнено(Выб.СледующийЭлемент) Тогда
			Стр = СТр + "->"+ УИДСлед;		
		КонецЕсли;
		Стр=Стр+Символы.ПС;
	Конеццикла;
	Возврат ("digraph TrafficLights {
	|node[fontname=""segoe ui""]
	|")+(ОписанияВершин)+" "+(стр)+("} ");

КонецФункции // ТекстGv()
